## Processing the Data_Train

### Preprocessing just on the df_train only

In [2]:
#------------autoreloader
%load_ext autoreload
%autoreload 2

In [8]:
#---------importing the src and other libraries
import sys
sys.path.append('../../../..')
from src.data.load_data import load_data, get_nan, get_shape, get_info, save_data
from src.featured_engineering.processing_cols import unique_values, value_counts, one_hot, label_encoding, columns_to_drop, split_numerical, split_numerical_further

In [11]:
#--------------data path
df_path = '../../../../data/raw/Data_Train.xlsx'

In [12]:
df = load_data(df_path)

In [13]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [14]:
#-------------shape of the dataset
shape_df = get_shape(df)
shape_df

(10683, 11)

In [15]:
#--------------checking nan values in the dataset
null_values_df = get_nan(df)
null_values_df

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              1
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        1
Additional_Info    0
Price              0
dtype: int64

##### -----------nan values : route column -----------

In [16]:
# -----------to handle, the nan checking the unique values
value_count_route = value_counts(df, ['Route'])
value_count_route

Route
DEL → BOM → COK          2376
BLR → DEL                1552
CCU → BOM → BLR           979
CCU → BLR                 724
BOM → HYD                 621
                         ...
CCU → IXZ → MAA → BLR       1
BOM → JAI → DEL → HYD       1
BOM → BBI → HYD             1
CCU → RPR → HYD → BLR       1
BLR → BOM → IXC → DEL       1
Name: count, Length: 128, dtype: int64

In [17]:
#-------------substituing with the mode
mode_route = df['Route'].mode().iloc[0]
df['Route'] = df['Route'].fillna(mode_route)

##### ------------nan values : total_stops column ------------

In [18]:
#-----------checking the value count for nan
value_counts_total_stops = value_counts(df, ['Total_Stops'])
value_counts_total_stops

Total_Stops
1 stop         5625
non-stop       3491
2 stops        1520
3 stops          45
4 stops           1
Name: count, dtype: int64

In [19]:
#------------substituting the nan with mode
mode_total_stops = df['Total_Stops'].mode().iloc[0]
df['Total_Stops'] = df['Total_Stops'].fillna(mode_total_stops)

In [21]:
#--------------checking again, if there are nan or not
null_values_df_v2 = get_nan(df)
null_values_df_v2

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              0
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        0
Additional_Info    0
Price              0
dtype: int64

In [22]:
#------------df.head() for the further operations and decisions
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [23]:
#------------seprating the categorical columns into 2 categories, onehot encoding and label encoding
cat_cols_to_onehot = ['Airline', 'Additional_Indo']
cat_cols_to_label = ['Source', 'Destination', 'Total_Stops']

In [24]:
#------------making the backup copy of the dataset
df_copy = df

In [25]:
#--------------checking df_copy.head()
df_copy.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [26]:
#----------------- checking for the nan as final check for df_copy
null_values_df_copy = get_nan(df_copy)
null_values_df_copy

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              0
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        0
Additional_Info    0
Price              0
dtype: int64

##### ----------Categorical column : Airline---------------

In [27]:
#----------------checking the unique values, just in case sometimes, the nan is also hidden there
unique_values_airline = unique_values(df, 'Airline')
unique_values_airline

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [28]:
#------------working on one hot columns
#------------checking the values first
value_count_airline = value_counts(df, 'Airline')
value_count_airline

Airline
Jet Airways                          3849
IndiGo                               2053
Air India                            1752
Multiple carriers                    1196
SpiceJet                              818
Vistara                               479
Air Asia                              319
GoAir                                 194
Multiple carriers Premium economy      13
Jet Airways Business                    6
Vistara Premium economy                 3
Trujet                                  1
Name: count, dtype: int64

In [29]:
#----------keeping top_3 categories only, and the rest as other
top_3_airlines = value_count_airline.head(3).index.to_list()
top_3_airlines

['Jet Airways', 'IndiGo', 'Air India']

In [30]:
#------------------now mapping the top 3 airlines and rest as other
df['Airline'] = df['Airline'].apply(lambda x : x if x in top_3_airlines else 'other')

In [31]:
#----------------getting the value count again for this feature
value_count_airline_v2 = value_counts(df, 'Airline')
value_count_airline_v2

Airline
Jet Airways    3849
other          3029
IndiGo         2053
Air India      1752
Name: count, dtype: int64

In [32]:
#----------------applying the one hot encoding
df = one_hot(df, ['Airline'])
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,1,0,0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,0,0,0
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882,0,1,0
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218,1,0,0
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302,1,0,0

##### ---------------Categorical column : Additional info---------------

In [33]:
#------------loading the unique values
unique_values_additional_info = unique_values(df, 'Additional_Info')
unique_values_additional_info

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [34]:
#--------------value counts
value_count_additional_info = value_counts(df, 'Additional_Info')
value_count_additional_info

Additional_Info
No info                         8345
In-flight meal not included     1982
No check-in baggage included     320
1 Long layover                    19
Change airports                    7
Business class                     4
No Info                            3
1 Short layover                    1
Red-eye flight                     1
2 Long layover                     1
Name: count, dtype: int64

In [35]:
#----------------making only 2 categories and then applying the one hot
df['Additional_Info'] = df['Additional_Info'].apply(lambda x : x if x == 'No info' else 'Some info')

In [36]:
#---------------checking the value counts again
value_count_additional_info_v2 = value_counts(df, 'Additional_Info')
value_count_additional_info_v2

Additional_Info
No info      8345
Some info    2338
Name: count, dtype: int64

In [37]:
#------------applying the one hot
df = one_hot(df, ['Additional_Info'])
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,1,0,0,0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,0,0,0,0
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882,0,1,0,0
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218,1,0,0,0
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302,1,0,0,0

In [39]:
#----------------dropping the old Additional_info and Airline column
drop_cols_v1 = ['Additional_Info', 'Airline']
df = columns_to_drop(df, drop_cols_v1)
df.head()

,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info
0,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,3897,1,0,0,0
1,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,7662,0,0,0,0
2,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,13882,0,1,0,0
3,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,6218,1,0,0,0
4,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,13302,1,0,0,0

##### ---------------------Categorical column : Source----------------

In [40]:
#------------------unique values for the column
unique_values_source = unique_values(df, 'Source')
unique_values_source

array(['Banglore', 'Kolkata', 'Delhi', 'Chennai', 'Mumbai'], dtype=object)

In [41]:
#---------------value counts for the column
value_count_source = value_counts(df, 'Source')
value_count_source

Source
Delhi       4537
Kolkata     2871
Banglore    2197
Mumbai       697
Chennai      381
Name: count, dtype: int64

In [42]:
#-------------this column requires the label encoding, so I will do the mapping based on departures meaning the airport is busy
#-------------mapping the categories
source_mapping = {cat : i for i, cat in enumerate(value_count_source.index)}
source_mapping

{'Delhi': 0, 'Kolkata': 1, 'Banglore': 2, 'Mumbai': 3, 'Chennai': 4}

In [43]:
#--------using the label encoding now
df = label_encoding(df, 'Source', source_mapping)
df.head()

,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info
0,24/03/2019,2,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,3897,1,0,0,0
1,1/05/2019,1,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,7662,0,0,0,0
2,9/06/2019,0,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,13882,0,1,0,0
3,12/05/2019,1,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,6218,1,0,0,0
4,01/03/2019,2,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,13302,1,0,0,0

##### --------------------categorical column : Destination-------------------

In [44]:
#---------------unique values
unique_value_destination = unique_values(df, 'Destination')
unique_value_destination

array(['New Delhi', 'Banglore', 'Cochin', 'Kolkata', 'Delhi', 'Hyderabad'],
      dtype=object)

In [45]:
#----------value_counts, for the same logic as source for mapping
value_count_destination = value_counts(df, 'Destination')
value_count_destination

Destination
Cochin       4537
Banglore     2871
Delhi        1265
New Delhi     932
Hyderabad     697
Kolkata       381
Name: count, dtype: int64

In [46]:
#----------Delhi and New Delhi are the same as destination
df['Destination'] = df['Destination'].apply(lambda x : 'Delhi' if x == 'New Delhi' else x)

In [47]:
#-----------------checking the values again
value_count_destination_v2 = value_counts(df, 'Destination')
value_count_destination_v2

Destination
Cochin       4537
Banglore     2871
Delhi        2197
Hyderabad     697
Kolkata       381
Name: count, dtype: int64

In [48]:
#-------------mapping the categories
destination_mapping = {cat : i for i, cat in enumerate(value_count_destination_v2.index)}
destination_mapping

{'Cochin': 0, 'Banglore': 1, 'Delhi': 2, 'Hyderabad': 3, 'Kolkata': 4}

In [49]:
#---------------appylying the mapping
df = label_encoding(df, 'Destination', destination_mapping)
df.head()

,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info
0,24/03/2019,2,2,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,3897,1,0,0,0
1,1/05/2019,1,1,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,7662,0,0,0,0
2,9/06/2019,0,0,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,13882,0,1,0,0
3,12/05/2019,1,1,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,6218,1,0,0,0
4,01/03/2019,2,2,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,13302,1,0,0,0

##### ---------------Categorical column : Total_Stops--------------------

In [50]:
#----------checking the unique values
unique_value_total_stops = unique_values(df, 'Total_Stops')
unique_value_total_stops

array(['non-stop', '2 stops', '1 stop', '3 stops', '4 stops'],
      dtype=object)

In [51]:
#--------------value counts for the column
value_counts_total_stops = value_counts(df, 'Total_Stops')
value_counts_total_stops

Total_Stops
1 stop      5626
non-stop    3491
2 stops     1520
3 stops       45
4 stops        1
Name: count, dtype: int64

In [52]:
#----------------mapping for the total_stops column, that has to be manual
#----------------for 3, 4 stops values are too few, so I will merge them with 2 stops to reduce the noise, 
#----------------but incase of test data, I will not
total_stops_mapping = {
    'non-stop' : 0,
    '1 stop' : 1,
    '2 stops' : 2,
    '3 stops' : 2,
    '4 stops' : 2
}
total_stops_mapping

{'non-stop': 0, '1 stop': 1, '2 stops': 2, '3 stops': 2, '4 stops': 2}

In [53]:
#------------applying the mapping
df = label_encoding(df, 'Total_Stops', total_stops_mapping)
df.head()

,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info
0,24/03/2019,2,2,BLR → DEL,22:20,01:10 22 Mar,2h 50m,0,3897,1,0,0,0
1,1/05/2019,1,1,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2,7662,0,0,0,0
2,9/06/2019,0,0,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2,13882,0,1,0,0
3,12/05/2019,1,1,CCU → NAG → BLR,18:05,23:30,5h 25m,1,6218,1,0,0,0
4,01/03/2019,2,2,BLR → NAG → DEL,16:50,21:35,4h 45m,1,13302,1,0,0,0

In [54]:
#---------------checking the value count again
value_counts_total_stops_v2 = value_counts(df, 'Total_Stops')
value_counts_total_stops_v2

Total_Stops
1    5626
0    3491
2    1566
Name: count, dtype: int64

##### ----------------working with numerical columns---------------

In [55]:
#------------df.head()
df.head()

,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info
0,24/03/2019,2,2,BLR → DEL,22:20,01:10 22 Mar,2h 50m,0,3897,1,0,0,0
1,1/05/2019,1,1,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2,7662,0,0,0,0
2,9/06/2019,0,0,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2,13882,0,1,0,0
3,12/05/2019,1,1,CCU → NAG → BLR,18:05,23:30,5h 25m,1,6218,1,0,0,0
4,01/03/2019,2,2,BLR → NAG → DEL,16:50,21:35,4h 45m,1,13302,1,0,0,0

In [56]:
numerical_cols = ['Date_of_Journey', 'Dep_Time', 'Arrival_Time', 'Duration']
numerical_cols

['Date_of_Journey', 'Dep_Time', 'Arrival_Time', 'Duration']

##### --------------numerical column : Date_of_Journey----------------

In [57]:
#-----------unqiue values
unique_value_date_of_journey = unique_values(df, 'Date_of_Journey')
unique_value_date_of_journey

array(['24/03/2019', '1/05/2019', '9/06/2019', '12/05/2019', '01/03/2019',
       '24/06/2019', '12/03/2019', '27/05/2019', '1/06/2019',
       '18/04/2019', '9/05/2019', '24/04/2019', '3/03/2019', '15/04/2019',
       '12/06/2019', '6/03/2019', '21/03/2019', '3/04/2019', '6/05/2019',
       '15/05/2019', '18/06/2019', '15/06/2019', '6/04/2019',
       '18/05/2019', '27/06/2019', '21/05/2019', '06/03/2019',
       '3/06/2019', '15/03/2019', '3/05/2019', '9/03/2019', '6/06/2019',
       '24/05/2019', '09/03/2019', '1/04/2019', '21/04/2019',
       '21/06/2019', '27/03/2019', '18/03/2019', '12/04/2019',
       '9/04/2019', '1/03/2019', '03/03/2019', '27/04/2019'], dtype=object)

In [58]:
#----------splitting the values
df = split_numerical(df, 'Date_of_Journey')
df.head()

,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Date_of_Journey_year
0,24/03/2019,2,2,BLR → DEL,22:20,01:10 22 Mar,2h 50m,0,3897,1,0,0,0,24,03,2019
1,1/05/2019,1,1,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2,7662,0,0,0,0,1,05,2019
2,9/06/2019,0,0,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2,13882,0,1,0,0,9,06,2019
3,12/05/2019,1,1,CCU → NAG → BLR,18:05,23:30,5h 25m,1,6218,1,0,0,0,12,05,2019
4,01/03/2019,2,2,BLR → NAG → DEL,16:50,21:35,4h 45m,1,13302,1,0,0,0,01,03,2019

In [59]:
#----------checking the values for the day, month and year column
unique_values_day = unique_values(df, 'Date_of_Journey_day')
unique_values_month = unique_values(df, 'Date_of_Journey_month')
unique_values_year = unique_values(df, 'Date_of_Journey_year')
print(f"{unique_values_day} :: {unique_values_month} :: {unique_values_year}")

['24' '1' '9' '12' '01' '27' '18' '3' '15' '6' '21' '06' '09' '03'] :: ['03' '05' '06' '04'] :: ['2019']

In [60]:
#---------------dropping the year and old date_of_journey column
#---------------year column because it doesn't contain any meaningful value, it's only one
drop_cols_v2 = ['Date_of_Journey', 'Date_of_Journey_year']
df = columns_to_drop(df, drop_cols_v2)
df.head()

,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month
0,2,2,BLR → DEL,22:20,01:10 22 Mar,2h 50m,0,3897,1,0,0,0,24,03
1,1,1,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2,7662,0,0,0,0,1,05
2,0,0,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2,13882,0,1,0,0,9,06
3,1,1,CCU → NAG → BLR,18:05,23:30,5h 25m,1,6218,1,0,0,0,12,05
4,2,2,BLR → NAG → DEL,16:50,21:35,4h 45m,1,13302,1,0,0,0,01,03

##### ------------------Numerical column : Dep_Time---------------------

In [61]:
#----------checking the unique values
unique_value_dep_time = unique_values(df, 'Dep_Time')
unique_value_dep_time

array(['22:20', '05:50', '09:25', '18:05', '16:50', '09:00', '18:55',
       '08:00', '08:55', '11:25', '09:45', '20:20', '11:40', '21:10',
       '17:15', '16:40', '08:45', '14:00', '20:15', '16:00', '14:10',
       '22:00', '04:00', '21:25', '21:50', '07:00', '07:05', '09:50',
       '14:35', '10:35', '15:05', '14:15', '06:45', '20:55', '11:10',
       '05:45', '19:00', '23:05', '11:00', '09:35', '21:15', '23:55',
       '19:45', '08:50', '15:40', '06:05', '15:00', '13:55', '05:55',
       '13:20', '05:05', '06:25', '17:30', '08:20', '19:55', '06:30',
       '14:05', '02:00', '09:40', '08:25', '20:25', '13:15', '02:15',
       '16:55', '20:45', '05:15', '19:50', '20:00', '06:10', '19:30',
       '04:45', '12:55', '18:15', '17:20', '15:25', '23:00', '12:00',
       '14:45', '11:50', '11:30', '14:40', '19:10', '06:00', '23:30',
       '07:35', '13:05', '12:30', '15:10', '12:50', '18:25', '16:30',
       '00:40', '06:50', '13:00', '19:15', '01:30', '17:00', '10:00',
       '19:35', '15:30', '12:10', '16:10', '20:35', '22:25', '21:05',
       '05:35', '05:10', '06:40', '15:15', '00:30', '08:30', '07:10',
       '05:30', '14:25', '05:25', '10:20', '17:45', '13:10', '22:10',
       '04:55', '17:50', '21:20', '06:20', '15:55', '20:30', '17:25',
       '09:30', '07:30', '02:35', '10:55', '17:10', '09:10', '18:45',
       '15:20', '22:50', '14:55', '14:20', '13:25', '22:15', '11:05',
       '16:15', '20:10', '06:55', '19:05', '07:55', '07:45', '10:10',
       '08:15', '11:35', '21:00', '17:55', '16:45', '18:20', '03:50',
       '08:35', '19:20', '20:05', '17:40', '04:40', '17:35', '09:55',
       '05:00', '18:00', '02:55', '20:40', '22:55', '22:40', '21:30',
       '08:10', '17:05', '07:25', '15:45', '09:15', '15:50', '11:45',
       '22:05', '18:35', '00:25', '19:40', '20:50', '22:45', '10:30',
       '23:25', '11:55', '10:45', '11:15', '12:20', '14:30', '07:15',
       '01:35', '18:40', '09:20', '21:55', '13:50', '01:40', '00:20',
       '04:15', '13:45', '18:30', '06:15', '02:05', '12:15', '13:30',
       '06:35', '10:05', '08:40', '03:05', '21:35', '16:35', '02:30',
       '16:25', '05:40', '15:35', '13:40', '07:20', '04:50', '12:45',
       '10:25', '12:05', '11:20', '21:40', '03:00'], dtype=object)

In [62]:
#---------------------splitting the values
df = split_numerical(df, 'Dep_Time')
df.head()

,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute
0,2,2,BLR → DEL,22:20,01:10 22 Mar,2h 50m,0,3897,1,0,0,0,24,03,22,20
1,1,1,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2,7662,0,0,0,0,1,05,05,50
2,0,0,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2,13882,0,1,0,0,9,06,09,25
3,1,1,CCU → NAG → BLR,18:05,23:30,5h 25m,1,6218,1,0,0,0,12,05,18,05
4,2,2,BLR → NAG → DEL,16:50,21:35,4h 45m,1,13302,1,0,0,0,01,03,16,50

In [63]:
#-------------------Dropping the old Dep_time and Route column
#-------------------we have source, destination and total_stops, that is why route column is not worth it
drop_cols_v3 = ['Route', 'Dep_Time']
df = columns_to_drop(df, drop_cols_v3)
df.head()

,Source,Destination,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute
0,2,2,01:10 22 Mar,2h 50m,0,3897,1,0,0,0,24,03,22,20
1,1,1,13:15,7h 25m,2,7662,0,0,0,0,1,05,05,50
2,0,0,04:25 10 Jun,19h,2,13882,0,1,0,0,9,06,09,25
3,1,1,23:30,5h 25m,1,6218,1,0,0,0,12,05,18,05
4,2,2,21:35,4h 45m,1,13302,1,0,0,0,01,03,16,50

##### -------------------- Numerical column : Arrival_Time ----------------------

In [64]:
#----------unique values
unique_value_arrival_time = unique_values(df, 'Arrival_Time')
unique_value_arrival_time

array(['01:10 22 Mar', '13:15', '04:25 10 Jun', ..., '06:50 10 Mar',
       '00:05 19 Mar', '21:20 13 Mar'], dtype=object)

In [15]:
#-----------here, we have 2 different formats, so my approach is to split and get the hour part,
#-----------after that work seprately on the minute part

In [65]:
#------------splitting the column
df = split_numerical(df, 'Arrival_Time')
df.head()

,Source,Destination,Arrival_Time,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute,Arrival_Time_hour,Arrival_Time_minute
0,2,2,01:10 22 Mar,2h 50m,0,3897,1,0,0,0,24,03,22,20,01,10 22 Mar
1,1,1,13:15,7h 25m,2,7662,0,0,0,0,1,05,05,50,13,15
2,0,0,04:25 10 Jun,19h,2,13882,0,1,0,0,9,06,09,25,04,25 10 Jun
3,1,1,23:30,5h 25m,1,6218,1,0,0,0,12,05,18,05,23,30
4,2,2,21:35,4h 45m,1,13302,1,0,0,0,01,03,16,50,21,35

In [66]:
#-----------dropping off the old Arrival_Time column
drop_cols_v4 = ['Arrival_Time']
df = columns_to_drop(df, drop_cols_v4)
df.head()

,Source,Destination,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute,Arrival_Time_hour,Arrival_Time_minute
0,2,2,2h 50m,0,3897,1,0,0,0,24,03,22,20,01,10 22 Mar
1,1,1,7h 25m,2,7662,0,0,0,0,1,05,05,50,13,15
2,0,0,19h,2,13882,0,1,0,0,9,06,09,25,04,25 10 Jun
3,1,1,5h 25m,1,6218,1,0,0,0,12,05,18,05,23,30
4,2,2,4h 45m,1,13302,1,0,0,0,01,03,16,50,21,35

##### -----------------numerical column : Arrival_Time_minute-------------------

In [67]:
#------------getting the unique values as usual
unique_value_arrival_time_minute = unique_values(df, 'Arrival_Time_minute')
unique_value_arrival_time_minute

array(['10 22 Mar', '15', '25 10 Jun', '30', '35', '25', '25 13 Mar',
       '05 02 Mar', '00', '55', '20 10 May', '50', '15 04 Mar',
       '35 13 Jun', '15 13 Jun', '35 28 May', '20', '20 19 Mar',
       '15 07 May', '35 10 Jun', '35 02 Jun', '35 16 Jun', '45', '10',
       '00 19 May', '05 16 May', '00 28 Jun', '55 02 May', '10 28 Mar',
       '15 19 Jun', '45 04 Apr', '00 25 Mar', '30 07 May', '45 07 Mar',
       '25 04 Apr', '30 16 May', '15 13 Mar', '35 25 Jun', '05',
       '00 10 Jun', '40 07 May', '25 07 Mar', '25 07 Jun', '25 25 May',
       '40', '15 10 Jun', '25 25 Jun', '35 13 May', '25 19 May',
       '15 10 May', '00 25 May', '05 16 Mar', '05 13 May', '35 04 Mar',
       '05 07 May', '15 02 Mar', '10 22 May', '00 07 May', '25 16 Jun',
       '30 22 May', '15 28 Jun', '30 10 Apr', '45 07 Jun', '55 22 May',
       '35 22 May', '25 04 Jun', '40 04 Apr', '50 22 Mar', '15 25 May',
       '55 10 May', '35 28 Jun', '15 13 May', '25 02 May', '25 28 May',
       '25 28 Mar', '35 04 Apr', '20 07 May', '05 13 Jun', '30 04 Apr',
       '50 22 May', '25 02 Jun', '50 28 Mar', '40 13 Jun', '40 25 Mar',
       '35 28 Mar', '25 20 May', '15 07 Jun', '50 04 Mar', '20 28 Apr',
       '30 25 Mar', '35 02 May', '20 25 Apr', '15 02 Jun', '50 25 May',
       '15 22 Mar', '00 04 Jun', '35 22 Mar', '30 25 Jun', '55 13 Jun',
       '05 07 Mar', '05 02 May', '30 07 Jun', '25 10 Apr', '15 10 Mar',
       '50 13 Jun', '25 04 Mar', '00 07 Jun', '30 28 May', '20 13 Mar',
       '05 19 May', '40 07 Jun', '30 28 Jun', '30 13 Mar', '00 28 May',
       '05 25 May', '35 10 Apr', '15 10 Apr', '50 07 Jun', '45 10 Jun',
       '05 16 Jun', '20 02 Jun', '55 07 Mar', '45 25 Mar', '50 16 May',
       '35 25 Mar', '00 16 Mar', '35 07 Mar', '35 10 May', '00 02 Jun',
       '50 19 May', '35 07 Jun', '45 13 Mar', '35 04 Jun', '40 16 Jun',
       '40 22 May', '20 19 Apr', '15 19 May', '00 13 Jun', '25 22 May',
       '25 22 Mar', '10 25 Mar', '20 13 May', '35 19 May', '50 10 Mar',
       '20 13 Apr', '05 10 Apr', '25 02 Apr', '40 10 Jun', '15 25 Jun',
       '40 16 May', '50 02 Apr', '30 16 Jun', '40 13 May', '30 10 Jun',
       '25 23 Mar', '40 22 Apr', '35 02 Apr', '40 07 Mar', '20 16 May',
       '25 28 Jun', '05 10 May', '30 02 Jun', '10 19 May', '40 02 Jun',
       '40 02 Mar', '05 25 Mar', '25 11 May', '40 10 May', '15 07 Mar',
       '25 07 Apr', '40 16 Mar', '50 19 Mar', '00 02 May', '25 10 May',
       '00 16 Jun', '00 10 May', '45 28 Mar', '30 02 May', '40 13 Mar',
       '05 13 Mar', '40 19 May', '45 19 May', '15 28 Mar', '15 25 Mar',
       '45 16 May', '15 28 May', '55 25 Mar', '25 13 May', '30 10 May',
       '25 03 May', '20 25 Mar', '40 28 Apr', '20 10 Jun', '00 22 May',
       '25 07 May', '35 25 May', '00 07 Apr', '45 13 Jun', '45 22 May',
       '25 16 May', '00 07 Mar', '25 10 Mar', '20 25 May', '50 25 Mar',
       '15 22 May', '30 13 Jun', '40 28 Mar', '25 08 Mar', '00 28 Mar',
       '10 02 Mar', '15 16 Mar', '55 19 May', '45 02 Mar', '20 19 Jun',
       '45 03 Mar', '40 02 Apr', '00 16 May', '10 07 Mar', '50 13 May',
       '40 25 May', '35 10 Mar', '15 16 May', '40 25 Jun', '40 10 Mar',
       '50 16 Mar', '20 22 May', '25 05 Mar', '20 22 Jun', '45 07 May',
       '00 02 Mar', '25 13 Jun', '00 22 Apr', '45 25 May', '20 16 Mar',
       '55 07 May', '40 07 Apr', '55 19 Mar', '05 22 May', '20 28 May',
       '40 28 May', '00 13 May', '30 25 May', '05 25 Jun', '20 04 May',
       '20 02 May', '40 10 Apr', '20 07 Jun', '30 13 May', '45 02 May',
       '40 28 Jun', '10 28 Apr', '30 04 Jun', '30 19 May', '50 07 May',
       '10 16 Mar', '35 02 Mar', '35 19 Mar', '20 19 May', '55 16 May',
       '55 10 Jun', '50 07 Mar', '05 10 Jun', '05 07 Jun', '15 04 Jun',
       '20 04 Jun', '30 02 Mar', '45 16 Mar', '20 02 Apr', '45 19 Jun',
       '20 04 Mar', '05 28 Mar', '10 13 Mar', '05 04 Apr', '10 07 Jun',
       '20 07 Mar', '50 13 Mar', '15 16 Jun', '00 04 Apr', '15 02 May',
       '15 22 Apr', '25 26 May', '40 04 Jun', '45 02 Apr', '15 04 Apr',
       '55 02 Mar', '10 02 Jun', '10 10 Jun', '45 16 Apr', '30 16 Mar',
       '25 02 Mar', '00 25 Jun', '45 10 May', '40 19 Mar', '10 10 Mar',
       '25 26 Jun', '50 04 Jun', '10 02 Apr', '20 07 Apr', '05 25 Apr',
       '45 13 May', '25 19 Mar', '05 07 Apr', '00 22 Jun', '05 28 May',
       '10 25 May', '00 02 Apr', '10 19 Mar', '55 07 Jun', '05 19 Jun',
       '40 04 Mar', '10 07 May', '25 29 May', '05 02 Apr', '20 13 Jun',
       '55 02 Apr', '15 19 Apr', '20 10 Mar', '30 07 Mar', '40 02 May',
       '50 10 May', '20 02 Mar', '10 16 May', '50 22 Jun', '15 28 Apr',
       '05 22 Mar', '20 16 Apr', '40 04 May', '10 28 Jun', '55 25 May',
       '25 25 Mar', '25 16 Mar', '00 19 Mar', '40 22 Jun', '25 29 Jun',
       '05 13 Apr', '35 07 May', '20 25 Jun', '20 10 Apr', '20 04 Apr',
       '15 02 Apr', '50 22 Apr', '40 13 Apr', '55 28 Mar', '10 10 Apr',
       '55 13 May', '50 04 May', '50 02 Jun', '15 22 Jun', '55 13 Mar',
       '40 16 Apr', '50 02 May', '45 22 Mar', '45 04 May', '00 19 Jun',
       '50 10 Jun', '45 28 Apr', '00 04 May', '15 16 Apr', '05 04 May',
       '50 07 Apr', '05 22 Jun', '40 19 Jun', '40 19 Apr', '30 02 Apr',
       '40 25 Apr', '05 04 Jun', '45 08 Mar', '05 19 Apr', '25 19 Jun',
       '05 02 Jun', '15 13 Apr', '10 04 Mar', '00 16 Apr', '20 28 Jun',
       '15 19 Mar', '20 16 Jun', '10 16 Jun', '40 22 Mar', '50 28 Apr',
       '35 16 Mar', '25 22 Jun', '45 10 Mar', '45 13 Apr', '05 28 Apr',
       '25 29 Mar', '05 04 Mar', '55 04 Mar', '00 28 Apr', '55 16 Mar',
       '45 07 Apr', '05 28 Jun', '50 25 Apr', '10 02 May', '20 22 Mar',
       '45 22 Jun', '10 25 Apr', '20 22 Apr', '35 07 Apr', '05 16 Apr',
       '00 22 Mar', '35 16 May', '10 10 May', '00 19 Apr', '45 10 Apr',
       '50 16 Jun', '55 22 Mar', '45 04 Jun', '10 13 Jun', '50 16 Apr',
       '50 28 Jun', '00 13 Mar', '00 10 Apr', '45 02 Jun', '30 25 Apr',
       '20 28 Mar', '05 10 Mar', '45 28 Jun', '25 23 May', '10 13 May',
       '50 10 Apr', '50 13 Apr', '15 04 May', '25 04 May', '05 22 Apr',
       '45 22 Apr', '45 28 May', '50 02 Mar', '50 28 May', '50 25 Jun',
       '00 25 Apr', '30 07 Apr', '55 10 Mar', '45 19 Apr', '45 19 Mar',
       '00 10 Mar', '25 17 Jun', '50 08 Mar', '50 19 Jun', '35 28 Apr',
       '05 19 Mar'], dtype=object)

In [68]:
#------------------further splitting the column
df = split_numerical_further(df, 'Arrival_Time_minute')
df.head()

,Source,Destination,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute,Arrival_Time_hour,Arrival_Time_minute
0,2,2,2h 50m,0,3897,1,0,0,0,24,03,22,20,01,10
1,1,1,7h 25m,2,7662,0,0,0,0,1,05,05,50,13,15
2,0,0,19h,2,13882,0,1,0,0,9,06,09,25,04,25
3,1,1,5h 25m,1,6218,1,0,0,0,12,05,18,05,23,30
4,2,2,4h 45m,1,13302,1,0,0,0,01,03,16,50,21,35

In [69]:
#----------------veryfying with the unique values
unique_value_arrival_time_minute_v2 = unique_values(df, 'Arrival_Time_minute')
unique_value_arrival_time_minute_v2

array(['10', '15', '25', '30', '35', '05', '00', '55', '20', '50', '45',
       '40'], dtype=object)

##### ---------------------numerical column : Duration----------------

In [70]:
#------------checking out the unique values
unique_value_duration = unique_values(df, 'Duration')
unique_value_duration

array(['2h 50m', '7h 25m', '19h', '5h 25m', '4h 45m', '2h 25m', '15h 30m',
       '21h 5m', '25h 30m', '7h 50m', '13h 15m', '2h 35m', '2h 15m',
       '12h 10m', '26h 35m', '4h 30m', '22h 35m', '23h', '20h 35m',
       '5h 10m', '15h 20m', '2h 55m', '13h 20m', '15h 10m', '5h 45m',
       '5h 55m', '13h 25m', '22h', '5h 30m', '10h 25m', '5h 15m',
       '2h 30m', '6h 15m', '11h 55m', '11h 5m', '8h 30m', '22h 5m',
       '2h 45m', '12h', '16h 5m', '19h 55m', '3h 15m', '25h 20m', '3h',
       '16h 15m', '15h 5m', '6h 30m', '25h 5m', '12h 25m', '27h 20m',
       '10h 15m', '10h 30m', '1h 30m', '1h 25m', '26h 30m', '7h 20m',
       '13h 30m', '5h', '19h 5m', '14h 50m', '2h 40m', '22h 10m',
       '9h 35m', '10h', '21h 20m', '18h 45m', '12h 20m', '18h', '9h 15m',
       '17h 30m', '16h 35m', '12h 15m', '7h 30m', '24h', '8h 55m',
       '7h 10m', '14h 30m', '30h 20m', '15h', '12h 45m', '10h 10m',
       '15h 25m', '14h 5m', '20h 15m', '23h 10m', '18h 10m', '16h',
       '2h 20m', '8h', '16h 55m', '3h 10m', '14h', '23h 50m', '21h 40m',
       '21h 15m', '10h 50m', '8h 15m', '8h 35m', '11h 50m', '27h 35m',
       '8h 25m', '20h 55m', '4h 50m', '8h 10m', '24h 25m', '23h 35m',
       '25h 45m', '26h 10m', '28h 50m', '25h 15m', '9h 20m', '9h 10m',
       '3h 5m', '11h 30m', '9h 30m', '17h 35m', '5h 5m', '25h 50m', '20h',
       '13h', '18h 25m', '24h 10m', '4h 55m', '25h 35m', '6h 20m',
       '18h 40m', '19h 25m', '29h 20m', '9h 5m', '10h 45m', '11h 40m',
       '22h 55m', '37h 25m', '25h 40m', '13h 55m', '8h 40m', '23h 30m',
       '12h 35m', '24h 15m', '1h 20m', '11h', '11h 15m', '14h 35m',
       '12h 55m', '9h', '7h 40m', '11h 45m', '24h 55m', '17h 5m',
       '29h 55m', '22h 15m', '14h 40m', '7h 15m', '20h 10m', '20h 45m',
       '27h', '24h 30m', '20h 25m', '5h 35m', '14h 45m', '5h 40m',
       '4h 5m', '15h 55m', '7h 45m', '28h 20m', '4h 20m', '3h 40m',
       '8h 50m', '23h 45m', '24h 45m', '21h 35m', '8h 5m', '6h 25m',
       '15h 50m', '26h 25m', '24h 50m', '26h', '23h 5m', '7h 55m',
       '26h 20m', '23h 15m', '5h 20m', '4h', '9h 45m', '8h 20m',
       '17h 25m', '7h 5m', '34h 5m', '6h 5m', '5h 50m', '7h', '4h 25m',
       '13h 45m', '19h 15m', '22h 30m', '16h 25m', '13h 50m', '27h 5m',
       '28h 10m', '4h 40m', '15h 40m', '4h 35m', '18h 30m', '38h 15m',
       '6h 35m', '12h 30m', '11h 20m', '7h 35m', '29h 35m', '26h 55m',
       '23h 40m', '12h 50m', '9h 50m', '21h 55m', '10h 55m', '21h 10m',
       '20h 40m', '30h', '13h 10m', '8h 45m', '6h 10m', '17h 45m',
       '21h 45m', '3h 55m', '17h 20m', '30h 30m', '21h 25m', '12h 40m',
       '24h 35m', '19h 10m', '22h 40m', '14h 55m', '21h', '6h 45m',
       '28h 40m', '9h 40m', '16h 40m', '16h 20m', '16h 45m', '1h 15m',
       '6h 55m', '11h 25m', '14h 20m', '12h 5m', '24h 5m', '28h 15m',
       '17h 50m', '20h 20m', '28h 5m', '10h 20m', '14h 15m', '35h 15m',
       '35h 35m', '26h 40m', '28h', '14h 25m', '13h 5m', '37h 20m',
       '36h 10m', '25h 55m', '35h 5m', '19h 45m', '27h 55m', '47h',
       '10h 35m', '1h 35m', '16h 10m', '38h 20m', '6h', '16h 50m',
       '14h 10m', '23h 20m', '17h 40m', '11h 35m', '18h 20m', '6h 40m',
       '30h 55m', '24h 40m', '29h 50m', '28h 25m', '17h 15m', '22h 45m',
       '25h 25m', '21h 50m', '33h 15m', '30h 15m', '3h 35m', '27h 40m',
       '30h 25m', '18h 50m', '27h 45m', '15h 15m', '10h 40m', '26h 15m',
       '36h 25m', '26h 50m', '15h 45m', '19h 40m', '22h 25m', '19h 35m',
       '25h', '26h 45m', '38h', '4h 15m', '25h 10m', '18h 15m', '6h 50m',
       '23h 55m', '17h 55m', '23h 25m', '17h 10m', '24h 20m', '28h 30m',
       '27h 10m', '19h 20m', '15h 35m', '9h 25m', '21h 30m', '34h 25m',
       '18h 35m', '29h 40m', '26h 5m', '29h 5m', '27h 25m', '16h 30m',
       '11h 10m', '28h 55m', '29h 10m', '34h', '30h 40m', '30h 45m',
       '32h 55m', '10h 5m', '35h 20m', '32h 5m', '31h 40m', '19h 50m',
       '33h 45m', '30h 10m', '13h 40m', '19h 30m', '31h 30m', '34h 30m',
       '27h 50m', '38h 35m', '42h 5m', '4h 10m', '39h 5m', '3h 50m', '5m',
       '32h 30m', '31h 55m', '33h 20m', '27h 30m', '18h 55m', '9h 55m',
       '41h 20m', '20h 5m', '31h 50m', '42h 45m', '3h 25m', '37h 10m',
       '29h 30m', '32h 20m', '20h 50m', '40h 20m', '13h 35m', '47h 40m'],
      dtype=object)

In [71]:
#---------------for this column, I will do the single split and then take the hour part only
#---------------applying the split
df = split_numerical(df, 'Duration')
df.head()

,Source,Destination,Duration,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute,Arrival_Time_hour,Arrival_Time_minute,Duration_in_hours,Duration_in_minutes
0,2,2,2h 50m,0,3897,1,0,0,0,24,03,22,20,01,10,2,50m
1,1,1,7h 25m,2,7662,0,0,0,0,1,05,05,50,13,15,7,25m
2,0,0,19h,2,13882,0,1,0,0,9,06,09,25,04,25,19,
3,1,1,5h 25m,1,6218,1,0,0,0,12,05,18,05,23,30,5,25m
4,2,2,4h 45m,1,13302,1,0,0,0,01,03,16,50,21,35,4,45m

In [72]:
#-------------keeping the hour part only and dropping the old Duration and Duration_minute columns
drop_cols_v5 = ['Duration', 'Duration_in_minutes']
df = columns_to_drop(df, drop_cols_v5)
df.head()

,Source,Destination,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute,Arrival_Time_hour,Arrival_Time_minute,Duration_in_hours
0,2,2,0,3897,1,0,0,0,24,03,22,20,01,10,2
1,1,1,2,7662,0,0,0,0,1,05,05,50,13,15,7
2,0,0,2,13882,0,1,0,0,9,06,09,25,04,25,19
3,1,1,1,6218,1,0,0,0,12,05,18,05,23,30,5
4,2,2,1,13302,1,0,0,0,01,03,16,50,21,35,4

In [73]:
#-------------veryfying by getting the unique values
unique_values_duration_in_hours = unique_values(df, 'Duration_in_hours')
unique_values_duration_in_hours

array(['2', '7', '19', '5', '4', '15', '21', '25', '13', '12', '26', '22',
       '23', '20', '10', '6', '11', '8', '16', '3', '27', '1', '14', '9',
       '18', '17', '24', '30', '28', '29', '37', '34', '38', '35', '36',
       '47', '33', '32', '31', '42', '39', '5m', '41', '40'], dtype=object)

In [74]:
#-----------so there is this value as '5m', I will replace it as mode of the distrubution
mode_duration_in_hours = df['Duration_in_hours'].mode().iloc[0]
mode_duration_in_hours

'2'

In [75]:
df['Duration_in_hours'] = df['Duration_in_hours'].apply(lambda x : '2' if x == '5m' else x)

In [76]:
#--------------re-veryfying the values
unique_values_duration_in_hours_v2 = unique_values(df, 'Duration_in_hours')
unique_values_duration_in_hours_v2

array(['2', '7', '19', '5', '4', '15', '21', '25', '13', '12', '26', '22',
       '23', '20', '10', '6', '11', '8', '16', '3', '27', '1', '14', '9',
       '18', '17', '24', '30', '28', '29', '37', '34', '38', '35', '36',
       '47', '33', '32', '31', '42', '39', '41', '40'], dtype=object)

In [77]:
df.head()

,Source,Destination,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute,Arrival_Time_hour,Arrival_Time_minute,Duration_in_hours
0,2,2,0,3897,1,0,0,0,24,03,22,20,01,10,2
1,1,1,2,7662,0,0,0,0,1,05,05,50,13,15,7
2,0,0,2,13882,0,1,0,0,9,06,09,25,04,25,19
3,1,1,1,6218,1,0,0,0,12,05,18,05,23,30,5
4,2,2,1,13302,1,0,0,0,01,03,16,50,21,35,4

In [78]:
#-----------------getting the final info check
df_info = get_info(df)
df_info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Source                     10683 non-null  int64
 1   Destination                10683 non-null  int64
 2   Total_Stops                10683 non-null  int64
 3   Price                      10683 non-null  int64
 4   Airline_IndiGo             10683 non-null  int32
 5   Airline_Jet Airways        10683 non-null  int32
 6   Airline_other              10683 non-null  int32
 7   Additional_Info_Some info  10683 non-null  int32
 8   Date_of_Journey_day        10683 non-null  object
 9   Date_of_Journey_month      10683 non-null  object
 10  Dep_Time_hour              10683 non-null  object
 11  Dep_Time_minute            10683 non-null  object
 12  Arrival_Time_hour          10683 non-null  object
 13  Arrival_Time_minute        10683 non-null  object
 14  Duration_in_hours          10683 non-null  object
dtypes: int32(4), int64(4), object(7)
memory usage: 1.1+ MB

##### --------------- completetion ------------

In [ ]:
### The dataset has been completed according to the intermidiate standards, now only the further checks before making the model ready
### QQ plot check and checking for the distributions then, it will straight go to the tree/distance based models
### same pipeline and similar logic will also follow on the test data.

In [79]:
#--------------saving the data
df_path = '../../../../data/intermidiate/train.csv'
save_data(df, df_path)

In [81]:
#---------------veryfying if everything went well
df = load_data(df_path)
df.head()

,Source,Destination,Total_Stops,Price,Airline_IndiGo,Airline_Jet Airways,Airline_other,Additional_Info_Some info,Date_of_Journey_day,Date_of_Journey_month,Dep_Time_hour,Dep_Time_minute,Arrival_Time_hour,Arrival_Time_minute,Duration_in_hours
0,2,2,0,3897,1,0,0,0,24,3,22,20,1,10,2
1,1,1,2,7662,0,0,0,0,1,5,5,50,13,15,7
2,0,0,2,13882,0,1,0,0,9,6,9,25,4,25,19
3,1,1,1,6218,1,0,0,0,12,5,18,5,23,30,5
4,2,2,1,13302,1,0,0,0,1,3,16,50,21,35,4